RTR01>enable
Password: 


RTR01#?
Exec commands:
  <1-99>      Session number to resume
  auto        Exec level Automation
  clear       Reset functions
  clock       Manage the system clock
  configure   Enter configuration mode
  connect     Open a terminal connection
  copy        Copy from one file to another
  debug       Debugging functions (see also 'undebug')
  delete      Delete a file
  dir         List files on a filesystem
  disable     Turn off privileged commands
  disconnect  Disconnect an existing network connection
  enable      Turn on privileged commands
  erase       Erase a filesystem
  exit        Exit from the EXEC
  logout      Exit from the EXEC
  mkdir       Create new directory
  more        Display the contents of a file
  no          Disable debugging informations
  ping        Send echo messages
  reload      Halt and perform a cold restart

RTR01#configure ?
  terminal  Configure from the terminal
  <cr>
RTR01#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.


RTR01(config)#?
Configure commands:
  aaa                Authentication, Authorization and Accounting.
  access-list        Add an access list entry
  banner             Define a login banner
  bba-group          Configure BBA Group
  boot               Modify system boot parameters
  cdp                Global CDP configuration subcommands
  class-map          Configure Class Map
  clock              Configure time-of-day clock
  config-register    Define the configuration register
  crypto             Encryption module
  default            Set a command to its defaults
  do                 To run exec commands in config mode
  dot11              IEEE 802.11 config commands
  enable             Modify enable password parameters
  end                Exit from configure mode
  exit               Exit from configure mode
  flow               Global Flow configuration subcommands
  hostname           Set system's network name
  interface          Select an interface to configure
  ip                 Global IP configuration subcommands
  ipv6               Global IPv6 configuration commands

RTR01(config)#boot ?
  system  System image file
  
  
RTR01(config)#boot system ?
  WORD   TFTP filename or URL
  flash  Boot from flash memory
  tftp   Boot from a tftp server
  
  
RTR01(config)#boot system flash ?
  WORD  System image filename
  
  
RTR01(config)#boot system flash c2900-universalk9-mz.SPA.151-4.M4.bin
RTR01(config)#

RTR01(config)#end


RTR01#show startup-config 
Using 891 bytes
!
version 15.1
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname RTR01
!
!
boot system tftp WORD 255.255.255.255
boot system flash c2900-universalk9-mz.SPA.151-4.M4.bin 
!


Notes -
a) "show flash" can provide more information
b) You should be Privil EXEC mode for this operation

System flash directory:
File  Length   Name/status
  3   33591768 c2900-universalk9-mz.SPA.151-4.M4.bin
  2   28282    sigdef-category.xml
  1   227537   sigdef-default.xml
[33847587 bytes used, 221896413 available, 255744000 total]
249856K bytes of processor board System flash (Read/Write)
